# St7NewFreedomCase

Creates a new freedom case within a Strand7 model.

long St7NewFreedomCase(long uID, char* CaseName)

Input Parameters

uID

Strand7 model file ID.

CaseName

String containing the name of the new freedom case.